///
///福彩3D统计渠道值
Map<String, String> fc3dCensusChannels = {
  'd1': '独胆',
  'd2': '双胆',
  'd3': '三胆',
  'c5': '选五',
  'c6': '选六',
  'c7': '选七',
  'k1': '杀一',
  'k2': '杀二',
};

///
///排列三统计渠道值
Map<String, String> pl3CensusChannels = {
  'd1': '独胆',
  'd2': '双胆',
  'd3': '三胆',
  'c5': '选五',
  'c6': '选六',
  'c7': '选七',
  'k1': '杀一',
  'k2': '杀二',
};

///
///
Map<String, String> ssqRedChannels = {
  'r1': '独胆',
  'r2': '双胆',
  'r3': '三胆',
  'r12': '12码',
  'r20': '20码',
  'r25': '25码',
  'rk3': '杀三',
  'rk6': '杀六',
};

///
///
Map<String, String> ssqBlueChannels = {
  'b3': '蓝三',
  'b5': '蓝五',
  'bk': '杀蓝',
};

///
///
Map<String, String> dltRedChannels = {
  'r1': '独胆',
  'r2': '双胆',
  'r3': '三胆',
  'r10': '10码',
  'r20': '20码',
  'rk3': '杀三',
  'rk6': '杀六',
};

///
///
Map<String, String> dltBlueChannels = {
  'b1': '蓝一',
  'b2': '蓝二',
  'b6': '蓝六',
  'bk': '杀蓝',
};

///
///
Map<String, String> qlcCensusChannels = {
  'r1': '独胆',
  'r2': '双胆',
  'r3': '三胆',
  'r12': '12码',
  'r18': '18码',
  'r22': '22码',
  'k3': '杀三',
  'k6': '杀六',
};

Map<int, int> weightValues = {
  0: 27,
  1: 25,
  2: 23,
  3: 21,
  4: 19,
  5: 17,
  6: 15,
  7: 13,
  8: 11,
  9: 9,
  10: 7,
  11: 5,
};
const Map<String, String> n3Channels = {
  'k1': '杀一码',
  'k2': '杀二码',
  'c7': '选七码',
  'c6': '选六码',
  'c5': '选五码',
  'd3': '定三胆',
  'd2': '定双胆',
};

///
/// 整体级别
Map<int, String> fullLevels = {
  100: '100',
  200: '200',
  400: '400',
  600: '600',
  800: '800',
  1000: '1000',
};

///
/// vip级别
Map<int, String> vipLevels = {
  10: '前10',
  20: '前20',
  50: '前50',
  100: '前100',
  150: '前150',
};

///0-9数字集合
///
List<int> balls = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];

///双色球中奖等级
Map<String, String> ssqLevel = {
  '61': '一等奖',
  '60': '二等奖',
  '51': '三等奖',
  '50': '四等奖',
  '41': '四等奖',
};

///大乐透中奖等级
Map<String, String> dltLevel = {
  '52': '一等奖',
  '51': '二等奖',
  '50': '三等奖',
  '42': '四等奖',
  '41': '五等奖',
  '40': '六等奖',
  '32': '六等奖',
};
